src/cf/src/Catalogs/ЗаменыЗадачПоПриоритизации/ЗаменыЗадачПоПриоритизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаменыЗадачПоПриоритизации</name>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриоритизацияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗамены</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗамены</name>
    <type>
      <types>EnumRef.СтатусыЗаменыЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтарыеЗадачи</name>
    <comment>Для замены</comment>
    <attributes>
      <name>Задача</name>
      <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
      <type>
        <types>TaskRef.ЗадачиПользователя</types>
      </type>
    </attributes>
    <attributes>
      <name>Трудозатраты</name>
      <type>
        <types>DefinedType.ТрудоемкостьЧасовНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>УчитыватьТолькоВремяНаОценку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НовыеЗадачи</name>
    <comment>На что заменить</comment>
    <attributes>
      <name>Задача</name>
      <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
      <type>
        <types>TaskRef.ЗадачиПользователя</types>
      </type>
    </attributes>
    <attributes>
      <name>Трудозатраты</name>
      <type>
        <types>DefinedType.ТрудоемкостьЧасовНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>УчитыватьТолькоВремяНаОценку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/ЗаменыЗадачПоПриоритизации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Ссылка.СтатусЗамены <> СтатусЗамены Тогда
		ДатаСтатуса = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Автоформирование наименования.
	ТекстСтарыеЗадачи = Справочники.ЗаменыЗадачПоПриоритизации.СформироватьСтрокуЗадачСписка(СтарыеЗадачи);
	ТекстНовыеЗадачи = Справочники.ЗаменыЗадачПоПриоритизации.СформироватьСтрокуЗадачСписка(НовыеЗадачи, Истина);
	
	// Примеры: 
	//	1 к 1: [Модификация данных HR: CR-003231]->[Преобразование системы учета: CR-0043123]
	//	2 к 1: [CR-003231|CR-003232]->[Преобразование системы учета: CR-0043123]
	//	2 к 2: [CR-003231|CR-003232]->[CR-0043123|CR-003236]
	//	0 к 1: [Без замены]->[Преобразование системы учета: CR-0043123]
	//	1 к 0: [Преобразование системы учета: CR-0043123]->[Перенос на следующий период]
	Наименование = СтрШаблон(НСтр("ru = '[%1]->[%2]'"), ТекстСтарыеЗадачи, ТекстНовыеЗадачи);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
